# Data Wrangling - Comparing TripAdvisor (Hotel) and Airbnb Data

## 1. Airbnb Data

## 1-1. Seoul

### 1-1-1. Extracting/Importing

In [2]:
# Dependencies 
import pandas as pd
import pymongo
from pymongo import MongoClient

In [326]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# FYI - To connect with local server 
# connect = 'mongodb://localhost:27017'
# client = pymongo.MongoClient(connect)

In [327]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [328]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_seoul_df = pd.DataFrame.from_dict(array1['seoul'])
airbnb_seoul_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Jung-gu, South Korea. Enjoy...",Jung-gu,"[37.56133, 126.99032]",LA VIE EN ROSE / Myeong-dong,[https://a0.muscache.com/im/pictures/b31c28c6-...,$34,5,179,https://www.airbnb.com/rooms/11444903
1,"Entire home/apt in Mapo-gu, South Korea. 홍대입구역...",Mapo-gu,"[37.5548, 126.93069]",Mapo basecamp,[https://a0.muscache.com/im/pictures/69f94036-...,$30,5,100,https://www.airbnb.com/rooms/22320269
2,"Entire home/apt in Mapo-gu, South Korea. Beaut...",Mapo-gu,"[37.54073, 126.94475]",#1 Connected to Mapo Stn./HAN River view/Hongdae,[https://a0.muscache.com/im/pictures/c448d8f3-...,$42,4.5,202,https://www.airbnb.com/rooms/12483669
3,"Entire home/apt in Jongno-gu, South Korea. Bra...",Jongno-gu,"[37.57022, 126.98395]",MyeongDong 803 ♥Big City Window♥ +Free WiFi,[https://a0.muscache.com/im/pictures/2921d007-...,$30,4.5,131,https://www.airbnb.com/rooms/8777431
4,"Entire home/apt in Jongno-gu, South Korea. com...",Jongno-gu,"[37.56845, 126.98422]",#603 ★Big City View★MyeongDong Guest house,[https://a0.muscache.com/im/pictures/78c5d7d7-...,$26,4.5,148,https://www.airbnb.com/rooms/9504315

### 1-1-2. Transforming/Cleaning

In [329]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_seoul_df)

304

In [330]:
# Check and clean data by dropping duplicates
airbnb_seoul_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_seoul_df)

278

In [331]:
# Create a filtered dataframe with specific columns 
airbnb_seoul_df1 = airbnb_seoul_df[['listing_price', 'listing_rating']].copy()
airbnb_seoul_df1.head()

  listing_price listing_rating
0           $34              5
1           $30              5
2           $42            4.5
3           $30            4.5
4           $26            4.5

In [332]:
# Clean data by removing units 
airbnb_seoul_df1['listing_price'] = airbnb_seoul_df1['listing_price'].str.replace('$', '')
airbnb_seoul_df1.head()

  listing_price listing_rating
0            34              5
1            30              5
2            42            4.5
3            30            4.5
4            26            4.5

In [333]:
# Check the information about the dataframe 
airbnb_seoul_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 278 entries, 0 to 303
Data columns (total 2 columns):
listing_price     278 non-null object
listing_rating    278 non-null object
dtypes: object(2)
memory usage: 6.5+ KB

In [334]:
# Check the summary statistics of dataframe
airbnb_seoul_df1.describe() # Receiving a description of the objects rather than numerics summary

       listing_price listing_rating
count            278            278
unique            64              3
top               25              5
freq              25            141

In [335]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_seoul_df1[col] = pd.to_numeric(airbnb_seoul_df1[col])

In [336]:
# Recheck the information about the dataframe
airbnb_seoul_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 278 entries, 0 to 303
Data columns (total 2 columns):
listing_price     278 non-null int64
listing_rating    278 non-null object
dtypes: int64(1), object(1)
memory usage: 6.5+ KB

In [337]:
# Recheck the summary statistics of dataframe
airbnb_seoul_df1.describe() # Receiving a description of the numerics

       listing_price
count     278.000000
mean       37.615108
std        17.369401
min        10.000000
25%        25.000000
50%        34.000000
75%        48.000000
max       126.000000

In [338]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_seoul_df2 = airbnb_seoul_df1.groupby(['listing_rating']).mean()
airbnb_seoul_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_seoul_df2.reset_index(level=0, inplace=True)
airbnb_seoul_df2.head()

  listing_rating  avg_price
0              4  31.500000
1            4.5  34.266667
2              5  40.907801

In [339]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_seoul_df3 = airbnb_seoul_df1.groupby(['listing_rating']).count()
airbnb_seoul_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_seoul_df3.reset_index(level=0, inplace=True)
airbnb_seoul_df3.head()

  listing_rating  count_price
0              4            2
1            4.5          135
2              5          141

In [340]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_seoul_df4 = airbnb_seoul_df3.merge(airbnb_seoul_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_seoul_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_seoul_df4.insert(0, 'city', 'Seoul', True)
airbnb_seoul_df4.insert(1, 'type', 'Airbnb', True)
airbnb_seoul_df4

    city    type rating  count_price  avg_price
0  Seoul  Airbnb      4            2  31.500000
1  Seoul  Airbnb    4.5          135  34.266667
2  Seoul  Airbnb      5          141  40.907801

## 1-2. Tokyo

### 1-2-1. Extracting/Importing

In [7]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [8]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_tokyo_df = pd.DataFrame.from_dict(array1['tokyo'])
airbnb_tokyo_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Minato, Japan. Help to make...",Minato,"[35.65029, 139.73327]",Stunning home in central Tokyo,[https://a0.muscache.com/im/pictures/45604883/...,$912,5,211,https://www.airbnb.com/rooms/2075509
1,"Entire home/apt in Shinjuku City, Japan. ** Ne...",Shinjuku City,"[35.69915, 139.70602]",Shinjuku! Free Wi-Fi + Good Location + Clean R...,[https://a0.muscache.com/im/pictures/66915e3c-...,$63,5,139,https://www.airbnb.com/rooms/14790144
2,"Private room in Shibuya-ku, Japan. Our comfort...",Shibuya-ku,"[35.67069, 139.68388]",Spacious! Shibuya House w/Garden,[https://a0.muscache.com/im/pictures/89281220/...,$246,5,145,https://www.airbnb.com/rooms/2238472
3,"Entire home/apt in Shibuya-ku, Japan. A comfor...",Shibuya-ku,"[35.679, 139.679]",Comfy&near Shinjuku/Shibuya#301,[https://a0.muscache.com/im/pictures/48d97e17-...,$36,5,177,https://www.airbnb.com/rooms/11976628
4,"Entire home/apt in Shibuya-ku, Japan. Located ...",Shibuya-ku,"[35.68332, 139.67732]",Shinjuku 3 storied House!100㎡&12pax&FREE PARKING,[https://a0.muscache.com/im/pictures/f539b3dd-...,$290,4.5,108,https://www.airbnb.com/rooms/17272529

### 1-2-2. Transforming/Cleaning

In [14]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_tokyo_df)

304

In [15]:
# Check and clean data by dropping duplicates
airbnb_tokyo_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_tokyo_df)

304

In [16]:
# Create a filtered dataframe with specific columns 
airbnb_tokyo_df1 = airbnb_tokyo_df[['listing_price', 'listing_rating']].copy()
airbnb_tokyo_df1.head()

  listing_price listing_rating
0          $912              5
1           $63              5
2          $246              5
3           $36              5
4          $290            4.5

In [20]:
# Clean data by removing units 
airbnb_tokyo_df1['listing_price'] = airbnb_tokyo_df1['listing_price'].str.replace('$', '')
airbnb_tokyo_df1['listing_price'] = airbnb_tokyo_df1['listing_price'].str.replace(',', '')
airbnb_tokyo_df1.head()

  listing_price listing_rating
0           912              5
1            63              5
2           246              5
3            36              5
4           290            4.5

In [21]:
# Check the information about the dataframe 
airbnb_tokyo_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 304 entries, 0 to 303
Data columns (total 2 columns):
listing_price     304 non-null object
listing_rating    304 non-null object
dtypes: object(2)
memory usage: 7.1+ KB

In [22]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_tokyo_df1[col] = pd.to_numeric(airbnb_tokyo_df1[col])

In [23]:
# Recheck the information about the dataframe
airbnb_tokyo_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 304 entries, 0 to 303
Data columns (total 2 columns):
listing_price     304 non-null int64
listing_rating    304 non-null object
dtypes: int64(1), object(1)
memory usage: 7.1+ KB

In [24]:
# Check the summary statistics of dataframe
airbnb_tokyo_df1.describe() # Receiving a description of the numerics

       listing_price
count     304.000000
mean      130.467105
std       144.854789
min        10.000000
25%        55.000000
50%        91.000000
75%       155.000000
max      1368.000000

In [25]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_tokyo_df2 = airbnb_tokyo_df1.groupby(['listing_rating']).mean()
airbnb_tokyo_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_tokyo_df2.reset_index(level=0, inplace=True)
airbnb_tokyo_df2.head()

  listing_rating   avg_price
0            4.5  121.037037
1              5  132.504000

In [26]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_tokyo_df3 = airbnb_tokyo_df1.groupby(['listing_rating']).count()
airbnb_tokyo_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_tokyo_df3.reset_index(level=0, inplace=True)
airbnb_tokyo_df3.head()

  listing_rating  count_price
0            4.5           54
1              5          250

In [324]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_tokyo_df4 = airbnb_tokyo_df3.merge(airbnb_tokyo_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_tokyo_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_tokyo_df4.insert(0, 'city', 'Tokyo', True)
airbnb_tokyo_df4.insert(1, 'type', 'Airbnb', True)
airbnb_tokyo_df4

    city    type rating  count_price   avg_price
0  Tokyo  Airbnb    4.5           54  121.037037
1  Tokyo  Airbnb      5          250  132.504000

## 1-3. Singapore

### 1-3-1. Extracting/Importing

In [28]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [29]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [30]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_singapore_df = pd.DataFrame.from_dict(array1['singapore'])
airbnb_singapore_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Singapore, Singapore. A Stu...",Singapore,"[1.29479, 103.82971]",★Deluxe Studio near Orchard MRT ★,[https://a0.muscache.com/im/pictures/65005894/...,$82,4.5,209,https://www.airbnb.com/rooms/4751362
1,"Entire home/apt in Singapore, Singapore. Moder...",Singapore,"[1.29533, 103.83797]",Relaxed & Spacious Studio w JACUZZI,[https://a0.muscache.com/im/pictures/51729791/...,$109,4.5,211,https://www.airbnb.com/rooms/3753251
2,"Private room in Singapore, Singapore. 近市区和地铁站的...",Singapore,"[1.32624, 103.85671]",City area Cozy room&Bath near MRT+ Pool&Gym 2,[https://a0.muscache.com/im/pictures/5c2962bc-...,$51,4.5,117,https://www.airbnb.com/rooms/15746707
3,"Entire home/apt in Singapore, Singapore. Our s...",Singapore,"[1.30386, 103.85459]",S5 @ City Central,[https://a0.muscache.com/im/pictures/890411b7-...,$77,5,231,https://www.airbnb.com/rooms/5377342
4,"Entire home/apt in Singapore, Singapore. A com...",Singapore,"[1.29321, 103.83014]","★Sunny, Newly Furnished Apt, 5 min to Orchard ...",[https://a0.muscache.com/im/pictures/104f6abd-...,$36,5,21,https://www.airbnb.com/rooms/29993904

### 1-3-2. Transforming/Cleaning

In [31]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_singapore_df)

301

In [32]:
# Check and clean data by dropping duplicates
airbnb_singapore_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_singapore_df)

301

In [33]:
# Create a filtered dataframe with specific columns 
airbnb_singapore_df1 = airbnb_singapore_df[['listing_price', 'listing_rating']].copy()
airbnb_singapore_df1.head()

  listing_price listing_rating
0           $82            4.5
1          $109            4.5
2           $51            4.5
3           $77              5
4           $36              5

In [34]:
# Clean data by removing units 
airbnb_singapore_df1['listing_price'] = airbnb_singapore_df1['listing_price'].str.replace('$', '')
airbnb_singapore_df1.head()

  listing_price listing_rating
0            82            4.5
1           109            4.5
2            51            4.5
3            77              5
4            36              5

In [35]:
# Check the information about the dataframe 
airbnb_singapore_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 301 entries, 0 to 300
Data columns (total 2 columns):
listing_price     301 non-null object
listing_rating    301 non-null object
dtypes: object(2)
memory usage: 7.1+ KB

In [36]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_singapore_df1[col] = pd.to_numeric(airbnb_singapore_df1[col])

In [37]:
# Recheck the information about the dataframe
airbnb_singapore_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 301 entries, 0 to 300
Data columns (total 2 columns):
listing_price     301 non-null int64
listing_rating    301 non-null object
dtypes: int64(1), object(1)
memory usage: 7.1+ KB

In [38]:
# Check the summary statistics of dataframe
airbnb_singapore_df1.describe() # Receiving a description of the numerics

       listing_price
count     301.000000
mean       64.152824
std        33.171824
min        15.000000
25%        39.000000
50%        58.000000
75%        85.000000
max       222.000000

In [39]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_singapore_df2 = airbnb_singapore_df1.groupby(['listing_rating']).mean()
airbnb_singapore_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_singapore_df2.reset_index(level=0, inplace=True)
airbnb_singapore_df2.head()

  listing_rating  avg_price
0            3.5  36.000000
1              4  42.266667
2            4.5  64.704142
3              5  70.009901

In [40]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_singapore_df3 = airbnb_singapore_df1.groupby(['listing_rating']).count()
airbnb_singapore_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_singapore_df3.reset_index(level=0, inplace=True)
airbnb_singapore_df3.head()

  listing_rating  count_price
0            3.5            1
1              4           30
2            4.5          169
3              5          101

In [323]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_singapore_df4 = airbnb_singapore_df3.merge(airbnb_singapore_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_singapore_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_singapore_df4.insert(0, 'city', 'Singapore', True)
airbnb_singapore_df4.insert(1, 'type', 'Airbnb', True)
airbnb_singapore_df4

        city    type rating  count_price  avg_price
0  Singapore  Airbnb    3.5            1  36.000000
1  Singapore  Airbnb      4           30  42.266667
2  Singapore  Airbnb    4.5          169  64.704142
3  Singapore  Airbnb      5          101  70.009901

## 1-4. New York City

### 1-4-1. Extracting/Importing

In [42]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [43]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [44]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_nyc_df = pd.DataFrame.from_dict(array1['nyc'])
airbnb_nyc_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Weehawken, United States. L...",Weehawken,"[40.77082, -74.01821]",Studio Apartment Minutes Away from Times Square,[https://a0.muscache.com/im/pictures/255bc11b-...,$40,5,118,https://www.airbnb.com/rooms/19638293
1,"Entire home/apt in Brooklyn, United States. My...",Brooklyn,"[40.682, -73.895]",Bright & Airy in Highland Park,[https://a0.muscache.com/im/pictures/890e1eb8-...,$50,5,34,https://www.airbnb.com/rooms/20685563
2,"Private room in New York, United States. Downt...",New York,"[40.71921, -73.99116]",Manhattan Lux Loft.Like.Love.Lots.Look !,[https://a0.muscache.com/im/pictures/12426057/...,$215,5,529,https://www.airbnb.com/rooms/834190
3,"Entire home/apt in New York, United States. th...",New York,"[40.75128, -73.97658]",Penthouse Studio East 50s Terrace,[https://a0.muscache.com/im/pictures/7424636/8...,$135,4.5,311,https://www.airbnb.com/rooms/593292
4,"Entire home/apt in Jersey City, United States....",Jersey City,"[40.71465, -74.0753]","Cute Quirky Garden apt, NYC adjacent",[https://a0.muscache.com/im/pictures/8b20491f-...,$68,5,106,https://www.airbnb.com/rooms/20573006

### 1-4-2. Transforming/Cleaning

In [45]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_nyc_df)

305

In [46]:
# Check and clean data by dropping duplicates
airbnb_nyc_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_nyc_df)

305

In [47]:
# Create a filtered dataframe with specific columns 
airbnb_nyc_df1 = airbnb_nyc_df[['listing_price', 'listing_rating']].copy()
airbnb_nyc_df1.head()

  listing_price listing_rating
0           $40              5
1           $50              5
2          $215              5
3          $135            4.5
4           $68              5

In [48]:
# Clean data by removing units 
airbnb_nyc_df1['listing_price'] = airbnb_nyc_df1['listing_price'].str.replace('$', '')
airbnb_nyc_df1.head()

  listing_price listing_rating
0            40              5
1            50              5
2           215              5
3           135            4.5
4            68              5

In [49]:
# Check the information about the dataframe 
airbnb_nyc_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 305 entries, 0 to 304
Data columns (total 2 columns):
listing_price     305 non-null object
listing_rating    305 non-null object
dtypes: object(2)
memory usage: 7.1+ KB

In [50]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_nyc_df1[col] = pd.to_numeric(airbnb_nyc_df1[col])

In [51]:
# Recheck the information about the dataframe
airbnb_nyc_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 305 entries, 0 to 304
Data columns (total 2 columns):
listing_price     305 non-null int64
listing_rating    305 non-null object
dtypes: int64(1), object(1)
memory usage: 7.1+ KB

In [52]:
# Check the summary statistics of dataframe
airbnb_nyc_df1.describe() # Receiving a description of the numerics

       listing_price
count     305.000000
mean       96.140984
std        59.817786
min        10.000000
25%        60.000000
50%        85.000000
75%       120.000000
max       700.000000

In [53]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_nyc_df2 = airbnb_nyc_df1.groupby(['listing_rating']).mean()
airbnb_nyc_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_nyc_df2.reset_index(level=0, inplace=True)
airbnb_nyc_df2.head()

  listing_rating   avg_price
0              4   72.800000
1            4.5   91.680851
2              5  103.750000

In [54]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_nyc_df3 = airbnb_nyc_df1.groupby(['listing_rating']).count()
airbnb_nyc_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_nyc_df3.reset_index(level=0, inplace=True)
airbnb_nyc_df3.head()

  listing_rating  count_price
0              4           20
1            4.5          141
2              5          144

In [322]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_nyc_df4 = airbnb_nyc_df3.merge(airbnb_nyc_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_nyc_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_nyc_df4.insert(0, 'city', 'New York City', True)
airbnb_nyc_df4.insert(1, 'type', 'Airbnb', True)
airbnb_nyc_df4

            city    type rating  count_price   avg_price
0  New York City  Airbnb      4           20   72.800000
1  New York City  Airbnb    4.5          141   91.680851
2  New York City  Airbnb      5          144  103.750000

## 1-5. Istanbul

### 1-5-1. Extracting/Importing

In [56]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [57]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [58]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_istanbul_df = pd.DataFrame.from_dict(array1['istanbul'])
airbnb_istanbul_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Beyoğlu, Turkey. Studio Apa...",Beyoğlu,"[41.036, 28.975]",Leon Apartment in Taksim # 201,[https://a0.muscache.com/im/pictures/94b0c194-...,$20,4.5,141,https://www.airbnb.com/rooms/9817509
1,"Entire home/apt in İstanbul, Turkey. One bedro...",İstanbul,"[41.039, 28.982]",Beautiful location 4 mins to Square,[https://a0.muscache.com/im/pictures/89042066/...,$36,5,199,https://www.airbnb.com/rooms/6682900
2,"Entire home/apt in Beyoğlu, Turkey. The Apartm...",Beyoğlu,"[41.036, 28.973]",Boutique Flat Central&History Istanbul/Taksim,[https://a0.muscache.com/im/pictures/fadb7177-...,$29,5,120,https://www.airbnb.com/rooms/12450284
3,"Entire home/apt in Istanbul, Turkey. The Studi...",Istanbul,"[41.029, 28.948]",Historic Old City Studio Apt Balat1,[https://a0.muscache.com/im/pictures/9161231/9...,$26,4.5,154,https://www.airbnb.com/rooms/659314
4,"Entire home/apt in Beyoğlu, Turkey. The Apartm...",Beyoğlu,"[41.036, 28.973]",Mini Economic Flat Central&History/istanbul,[https://a0.muscache.com/im/pictures/d6a930fb-...,$21,4.5,106,https://www.airbnb.com/rooms/19342177

### 1-5-2. Transforming/Cleaning

In [59]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_istanbul_df)

300

In [60]:
# Check and clean data by dropping duplicates
airbnb_istanbul_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_istanbul_df)

275

In [61]:
# Create a filtered dataframe with specific columns 
airbnb_istanbul_df1 = airbnb_istanbul_df[['listing_price', 'listing_rating']].copy()
airbnb_istanbul_df1.head()

  listing_price listing_rating
0           $20            4.5
1           $36              5
2           $29              5
3           $26            4.5
4           $21            4.5

In [62]:
# Clean data by removing units 
airbnb_istanbul_df1['listing_price'] = airbnb_istanbul_df1['listing_price'].str.replace('$', '')
airbnb_istanbul_df1.head()

  listing_price listing_rating
0            20            4.5
1            36              5
2            29              5
3            26            4.5
4            21            4.5

In [63]:
# Check the information about the dataframe 
airbnb_istanbul_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 275 entries, 0 to 299
Data columns (total 2 columns):
listing_price     275 non-null object
listing_rating    275 non-null object
dtypes: object(2)
memory usage: 6.4+ KB

In [64]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_istanbul_df1[col] = pd.to_numeric(airbnb_istanbul_df1[col])

In [65]:
# Recheck the information about the dataframe
airbnb_istanbul_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 275 entries, 0 to 299
Data columns (total 2 columns):
listing_price     275 non-null int64
listing_rating    275 non-null object
dtypes: int64(1), object(1)
memory usage: 6.4+ KB

In [66]:
# Check the summary statistics of dataframe
airbnb_istanbul_df1.describe() # Receiving a description of the numerics

       listing_price
count     275.000000
mean       38.945455
std        23.244510
min         9.000000
25%        24.000000
50%        32.000000
75%        48.000000
max       164.000000

In [67]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_istanbul_df2 = airbnb_istanbul_df1.groupby(['listing_rating']).mean()
airbnb_istanbul_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_istanbul_df2.reset_index(level=0, inplace=True)
airbnb_istanbul_df2.head()

  listing_rating  avg_price
0              4  22.100000
1            4.5  33.097744
2              5  48.081967

In [68]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_istanbul_df3 = airbnb_istanbul_df1.groupby(['listing_rating']).count()
airbnb_istanbul_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_istanbul_df3.reset_index(level=0, inplace=True)
airbnb_istanbul_df3.head()

  listing_rating  count_price
0              4           20
1            4.5          133
2              5          122

In [321]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_istanbul_df4 = airbnb_istanbul_df3.merge(airbnb_istanbul_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_istanbul_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_istanbul_df4.insert(0, 'city', 'Istanbul', True)
airbnb_istanbul_df4.insert(1, 'type', 'Airbnb', True)
airbnb_istanbul_df4

       city    type rating  count_price  avg_price
0  Istanbul  Airbnb      4           20  22.100000
1  Istanbul  Airbnb    4.5          133  33.097744
2  Istanbul  Airbnb      5          122  48.081967

## 1-6. Paris

### 1-6-1. Extracting/Importing

In [70]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [71]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [72]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_paris_df = pd.DataFrame.from_dict(array1['paris'])
airbnb_paris_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Paris, France. Comfortable ...",Paris,"[48.87118, 2.3039]",Champs-Élysées Golden triangle flat with mezza...,[https://a0.muscache.com/im/pictures/63119ccc-...,$65,4.5,141,https://www.airbnb.com/rooms/22475432
1,"Entire home/apt in Paris, France. This charmin...",Paris,"[48.88345, 2.36852]",Charming Studio near the Canal Saint-Martin,[https://a0.muscache.com/im/pictures/06a37d7d-...,$56,4.5,299,https://www.airbnb.com/rooms/17477516
2,"Private room in Paris, France. The studio is ...",Paris,"[48.85138, 2.34999]",Jeanne's Studio near Notre-Dame,[https://a0.muscache.com/im/pictures/19608404/...,$63,4.5,345,https://www.airbnb.com/rooms/1300306
3,"Entire home/apt in Paris, France. Sunny and qu...",Paris,"[48.82476, 2.33548]",Studio of 27m²,[https://a0.muscache.com/im/pictures/91051b4f-...,$67,5,137,https://www.airbnb.com/rooms/8955630
4,"Entire home/apt in FR, France. Superb 15 sqm s...",FR,"[48.85759, 2.35292]",Cosy studio in the heart of Paris,[https://a0.muscache.com/im/pictures/9395166/6...,$123,4.5,458,https://www.airbnb.com/rooms/668799

### 1-6-2. Transforming/Cleaning

In [73]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_paris_df)

298

In [74]:
# Check and clean data by dropping duplicates
airbnb_paris_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_paris_df)

298

In [75]:
# Create a filtered dataframe with specific columns 
airbnb_paris_df1 = airbnb_paris_df[['listing_price', 'listing_rating']].copy()
airbnb_paris_df1.head()

  listing_price listing_rating
0           $65            4.5
1           $56            4.5
2           $63            4.5
3           $67              5
4          $123            4.5

In [76]:
# Clean data by removing units 
airbnb_paris_df1['listing_price'] = airbnb_paris_df1['listing_price'].str.replace('$', '')
airbnb_paris_df1.head()

  listing_price listing_rating
0            65            4.5
1            56            4.5
2            63            4.5
3            67              5
4           123            4.5

In [77]:
# Check the information about the dataframe 
airbnb_paris_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 298 entries, 0 to 297
Data columns (total 2 columns):
listing_price     298 non-null object
listing_rating    298 non-null object
dtypes: object(2)
memory usage: 7.0+ KB

In [78]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_paris_df1[col] = pd.to_numeric(airbnb_paris_df1[col])

In [79]:
# Check the information about the dataframe
airbnb_paris_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 298 entries, 0 to 297
Data columns (total 2 columns):
listing_price     298 non-null int64
listing_rating    298 non-null object
dtypes: int64(1), object(1)
memory usage: 7.0+ KB

In [81]:
# Check the summary statistics of dataframe
airbnb_paris_df1.describe() # Receiving a description of the numerics

       listing_price
count     298.000000
mean       77.879195
std        33.028487
min        10.000000
25%        55.000000
50%        74.000000
75%        95.000000
max       207.000000

In [82]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_paris_df2 = airbnb_paris_df1.groupby(['listing_rating']).mean()
airbnb_paris_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_paris_df2.reset_index(level=0, inplace=True)
airbnb_paris_df2.head()

  listing_rating  avg_price
0            3.5  28.000000
1              4  63.066667
2            4.5  74.117284
3              5  85.225000

In [83]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_paris_df3 = airbnb_paris_df1.groupby(['listing_rating']).count()
airbnb_paris_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_paris_df3.reset_index(level=0, inplace=True)
airbnb_paris_df3.head()

  listing_rating  count_price
0            3.5            1
1              4           15
2            4.5          162
3              5          120

In [320]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_paris_df4 = airbnb_paris_df3.merge(airbnb_paris_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_paris_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_paris_df4.insert(0, 'city', 'Paris', True)
airbnb_paris_df4.insert(1, 'type', 'Airbnb', True)
airbnb_paris_df4

    city    type rating  count_price  avg_price
0  Paris  Airbnb    3.5            1  28.000000
1  Paris  Airbnb      4           15  63.066667
2  Paris  Airbnb    4.5          162  74.117284
3  Paris  Airbnb      5          120  85.225000

## 1-7. Dubai

### 1-7-1. Extracting/Importing

In [91]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [92]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [93]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_dubai_df = pd.DataFrame.from_dict(array1['dubai'])
airbnb_dubai_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Dubai, United Arab Emirates...",Dubai,"[25.19844, 55.27044]",Iconic Two-Bedroom Apartment Burj Khalifa View,[https://a0.muscache.com/im/pictures/d3c94cfd-...,$98,5,63,https://www.airbnb.com/rooms/13144066
1,"Entire home/apt in Dubai, United Arab Emirates...",Dubai,"[25.095, 55.177]",Fully Funished Studio Apartment1,[https://a0.muscache.com/im/pictures/991ce7c5-...,$45,4.5,104,https://www.airbnb.com/rooms/5321565
2,"Private room in Dubai, United Arab Emirates. T...",Dubai,"[25.08893, 55.14915]",Pristine Master Room Sunrise at 51st,[https://a0.muscache.com/im/pictures/fb82c457-...,$42,4.5,320,https://www.airbnb.com/rooms/4822756
3,"Entire home/apt in Dubai, United Arab Emirates...",Dubai,"[25.19062, 55.2743]",Downtown apartment-perfect location,[https://a0.muscache.com/im/pictures/d3764c64-...,$44,4.5,153,https://www.airbnb.com/rooms/14946524
4,"Entire home/apt in Dubai, United Arab Emirates...",Dubai,"[25.20701, 55.2777]",Breathtaking Highway View - Financial Center D...,[https://a0.muscache.com/im/pictures/47f88d75-...,$78,5,40,https://www.airbnb.com/rooms/14394753

### 1-7-2. Transforming/Cleaning

In [94]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_dubai_df)

281

In [95]:
# Check and clean data by dropping duplicates
airbnb_dubai_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_dubai_df)

281

In [96]:
# Create a filtered dataframe with specific columns 
airbnb_dubai_df1 = airbnb_dubai_df[['listing_price', 'listing_rating']].copy()
airbnb_dubai_df1.head()

  listing_price listing_rating
0           $98              5
1           $45            4.5
2           $42            4.5
3           $44            4.5
4           $78              5

In [97]:
# Clean data by removing units 
airbnb_dubai_df1['listing_price'] = airbnb_dubai_df1['listing_price'].str.replace('$', '')
airbnb_dubai_df1.head()

  listing_price listing_rating
0            98              5
1            45            4.5
2            42            4.5
3            44            4.5
4            78              5

In [98]:
# Check the information about the dataframe 
airbnb_dubai_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 281 entries, 0 to 280
Data columns (total 2 columns):
listing_price     281 non-null object
listing_rating    281 non-null object
dtypes: object(2)
memory usage: 6.6+ KB

In [99]:
# Check the summary statistics of dataframe
airbnb_dubai_df1.describe() # Receiving a description of the objects rather than numerics summary

       listing_price listing_rating
count            281            281
unique            99              3
top               45              5
freq              22            141

In [100]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_dubai_df1[col] = pd.to_numeric(airbnb_dubai_df1[col])

In [101]:
# Recheck the information about the dataframe
airbnb_dubai_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 281 entries, 0 to 280
Data columns (total 2 columns):
listing_price     281 non-null int64
listing_rating    281 non-null object
dtypes: int64(1), object(1)
memory usage: 6.6+ KB

In [102]:
# Recheck the summary statistics of dataframe
airbnb_dubai_df1.describe() # Receiving a description of the numerics

       listing_price
count     281.000000
mean       67.505338
std        33.960073
min        13.000000
25%        45.000000
50%        56.000000
75%        84.000000
max       234.000000

In [103]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_dubai_df2 = airbnb_dubai_df1.groupby(['listing_rating']).mean()
airbnb_dubai_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_dubai_df2.reset_index(level=0, inplace=True)
airbnb_dubai_df2.head()

  listing_rating  avg_price
0              4  45.000000
1            4.5  61.813953
2              5  74.468085

In [104]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_dubai_df3 = airbnb_dubai_df1.groupby(['listing_rating']).count()
airbnb_dubai_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_dubai_df3.reset_index(level=0, inplace=True)
airbnb_dubai_df3.head()

  listing_rating  count_price
0              4           11
1            4.5          129
2              5          141

In [319]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_dubai_df4 = airbnb_dubai_df3.merge(airbnb_dubai_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_dubai_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_dubai_df4.insert(0, 'city', 'Dubai', True)
airbnb_dubai_df4.insert(1, 'type', 'Airbnb', True)
airbnb_dubai_df4

    city    type rating  count_price  avg_price
0  Dubai  Airbnb      4           11  45.000000
1  Dubai  Airbnb    4.5          129  61.813953
2  Dubai  Airbnb      5          141  74.468085

## 1-8. Kuala Lumpur

### 1-8-1. Extracting/Importing

In [106]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [107]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [108]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_kl_df = pd.DataFrame.from_dict(array1['kl'])
airbnb_kl_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Private room in Kuala Lumpur, Malaysia. Tastef...",Kuala Lumpur,"[3.16497, 101.69373]","Infinity Pool KL@Near City Center,KLCC 92B",[https://a0.muscache.com/im/pictures/136f0d72-...,$17,4.5,232,https://www.airbnb.com/rooms/8584041
1,"Entire home/apt in Kuala Lumpur, Malaysia. We ...",Kuala Lumpur,"[3.149, 101.708]",i05 Executive Balcony Suite,[https://a0.muscache.com/im/pictures/b0694598-...,$18,4.5,161,https://www.airbnb.com/rooms/18722739
2,"Entire home/apt in Kuala Lumpur, Malaysia. We ...",Kuala Lumpur,"[3.145, 101.706]","S11 One Bedroom Deluxe Suite KLCC, Bukit Bintang",[https://a0.muscache.com/im/pictures/fdf00ac3-...,$15,4.5,147,https://www.airbnb.com/rooms/20140832
3,"Private room in Kuala Lumpur, Malaysia. Welcom...",Kuala Lumpur,"[3.15792, 101.70486]","Infinity Sky Pool, Near KLCC Subway 2A",[https://a0.muscache.com/im/pictures/dd750977-...,$38,5,203,https://www.airbnb.com/rooms/16008902
4,"Entire home/apt in Kuala Lumpur, Malaysia. Hi,...",Kuala Lumpur,"[3.13742, 101.71143]","D126 D'majestic Suite Bukit Bintang, KLCC",[https://a0.muscache.com/im/pictures/e6a6ca61-...,$12,4.5,65,https://www.airbnb.com/rooms/26887816

### 1-8-2. Transforming/Cleaning

In [109]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_kl_df)

297

In [110]:
# Check and clean data by dropping duplicates
airbnb_kl_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_kl_df)

285

In [111]:
# Create a filtered dataframe with specific columns 
airbnb_kl_df1 = airbnb_kl_df[['listing_price', 'listing_rating']].copy()
airbnb_kl_df1.head()

  listing_price listing_rating
0           $17            4.5
1           $18            4.5
2           $15            4.5
3           $38              5
4           $12            4.5

In [112]:
# Clean data by removing units 
airbnb_kl_df1['listing_price'] = airbnb_kl_df1['listing_price'].str.replace('$', '')
airbnb_kl_df1.head()

  listing_price listing_rating
0            17            4.5
1            18            4.5
2            15            4.5
3            38              5
4            12            4.5

In [113]:
# Check the information about the dataframe 
airbnb_kl_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 285 entries, 0 to 296
Data columns (total 2 columns):
listing_price     285 non-null object
listing_rating    285 non-null object
dtypes: object(2)
memory usage: 6.7+ KB

In [114]:
# Check the summary statistics of dataframe
airbnb_kl_df1.describe() # Receiving a description of the objects rather than numerics summary

       listing_price listing_rating
count            285            285
unique            44              3
top               12            4.5
freq              32            164

In [115]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_kl_df1[col] = pd.to_numeric(airbnb_kl_df1[col])

In [116]:
# Recheck the information about the dataframe
airbnb_kl_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 285 entries, 0 to 296
Data columns (total 2 columns):
listing_price     285 non-null int64
listing_rating    285 non-null object
dtypes: int64(1), object(1)
memory usage: 6.7+ KB

In [117]:
# Recheck the summary statistics of dataframe
airbnb_kl_df1.describe() # Receiving a description of the numerics

       listing_price
count     285.000000
mean       23.940351
std        10.798407
min        10.000000
25%        16.000000
50%        22.000000
75%        28.000000
max        69.000000

In [118]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_kl_df2 = airbnb_kl_df1.groupby(['listing_rating']).mean()
airbnb_kl_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_kl_df2.reset_index(level=0, inplace=True)
airbnb_kl_df2.head()

  listing_rating  avg_price
0              4  13.444444
1            4.5  20.231707
2              5  30.214286

In [119]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_kl_df3 = airbnb_kl_df1.groupby(['listing_rating']).count()
airbnb_kl_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_kl_df3.reset_index(level=0, inplace=True)
airbnb_kl_df3.head()

  listing_rating  count_price
0              4            9
1            4.5          164
2              5          112

In [318]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_kl_df4 = airbnb_kl_df3.merge(airbnb_kl_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_kl_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_kl_df4.insert(0, 'city', 'Kuala Lumpur', True)
airbnb_kl_df4.insert(1, 'type', 'Airbnb', True)
airbnb_kl_df4

           city    type rating  count_price  avg_price
0  Kuala Lumpur  Airbnb      4            9  13.444444
1  Kuala Lumpur  Airbnb    4.5          164  20.231707
2  Kuala Lumpur  Airbnb      5          112  30.214286

## 1-9. Bangkok

### 1-9-1. Extracting/Importing

In [123]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [124]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [125]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_bangkok_df = pd.DataFrame.from_dict(array1['bangkok'])
airbnb_bangkok_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in Phayathai, Thailand. -Non S...",Phayathai,"[13.774, 100.541]",Beautiful One Bedroom Apartment Near skytrain,[https://a0.muscache.com/im/pictures/15767a43-...,$36,5,453,https://www.airbnb.com/rooms/20869092
1,"Entire home/apt in Bangkok, Thailand. The 42 s...",Bangkok,"[13.71471, 100.51288]","42 sqm with pool, near BTS & RIVER",[https://a0.muscache.com/im/pictures/26496332/...,$41,4.5,469,https://www.airbnb.com/rooms/1870709
2,"Entire home/apt in Bangkok, Thailand. All abou...",Bangkok,"[13.72226, 100.57816]",Upscale Greenery designer loft FREE tuktuk to...,[https://a0.muscache.com/im/pictures/0ff0ed44-...,$45,5,209,https://www.airbnb.com/rooms/11853208
3,"Entire home/apt in Bangkok, Thailand. -Located...",Bangkok,"[13.749, 100.527]",BoutiqueResidence@Siam Pool Airport Trans. 暹羅中心,[https://a0.muscache.com/im/pictures/bd123f41-...,$33,4.5,210,https://www.airbnb.com/rooms/5301867
4,"Entire home/apt in Bangkok, Thailand. A Brand ...",Bangkok,"[13.71486, 100.59591]","*New Bangkok Choice near all City Transit, Wif...",[https://a0.muscache.com/im/pictures/4b1baa18-...,$21,5,220,https://www.airbnb.com/rooms/17857237

### 1-9-2. Transforming/Cleaning

In [126]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_bangkok_df)

301

In [127]:
# Check and clean data by dropping duplicates
airbnb_bangkok_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_bangkok_df)

301

In [128]:
# Create a filtered dataframe with specific columns 
airbnb_bangkok_df1 = airbnb_bangkok_df[['listing_price', 'listing_rating']].copy()
airbnb_bangkok_df1.head()

  listing_price listing_rating
0           $36              5
1           $41            4.5
2           $45              5
3           $33            4.5
4           $21              5

In [129]:
# Clean data by removing units 
airbnb_bangkok_df1['listing_price'] = airbnb_bangkok_df1['listing_price'].str.replace('$', '')
airbnb_bangkok_df1.head()

  listing_price listing_rating
0            36              5
1            41            4.5
2            45              5
3            33            4.5
4            21              5

In [130]:
# Check the information about the dataframe 
airbnb_bangkok_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 301 entries, 0 to 300
Data columns (total 2 columns):
listing_price     301 non-null object
listing_rating    301 non-null object
dtypes: object(2)
memory usage: 7.1+ KB

In [131]:
# Check the summary statistics of dataframe
airbnb_bangkok_df1.describe() # Receiving a description of the objects rather than numerics summary

       listing_price listing_rating
count            301            301
unique            66              3
top               28              5
freq              16            202

In [132]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_bangkok_df1[col] = pd.to_numeric(airbnb_bangkok_df1[col])

In [133]:
# Recheck the information about the dataframe
airbnb_bangkok_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 301 entries, 0 to 300
Data columns (total 2 columns):
listing_price     301 non-null int64
listing_rating    301 non-null object
dtypes: int64(1), object(1)
memory usage: 7.1+ KB

In [134]:
# Recheck the summary statistics of dataframe
airbnb_bangkok_df1.describe() # Receiving a description of the numerics

       listing_price
count     301.000000
mean       35.601329
std        19.872440
min        10.000000
25%        22.000000
50%        31.000000
75%        45.000000
max       127.000000

In [135]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_bangkok_df2 = airbnb_bangkok_df1.groupby(['listing_rating']).mean()
airbnb_bangkok_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_bangkok_df2.reset_index(level=0, inplace=True)
airbnb_bangkok_df2.head()

  listing_rating  avg_price
0              4  47.500000
1            4.5  29.412371
2              5  38.455446

In [136]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_bangkok_df3 = airbnb_bangkok_df1.groupby(['listing_rating']).count()
airbnb_bangkok_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_bangkok_df3.reset_index(level=0, inplace=True)
airbnb_bangkok_df3.head()

  listing_rating  count_price
0              4            2
1            4.5           97
2              5          202

In [317]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_bangkok_df4 = airbnb_bangkok_df3.merge(airbnb_bangkok_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_bangkok_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_bangkok_df4.insert(0, 'city', 'Bangkok', True)
airbnb_bangkok_df4.insert(1, 'type', 'Airbnb', True)
airbnb_bangkok_df4

      city    type rating  count_price  avg_price
0  Bangkok  Airbnb      4            2  47.500000
1  Bangkok  Airbnb    4.5           97  29.412371
2  Bangkok  Airbnb      5          202  38.455446

## 1-10. London

### 1-10-1. Extracting/Importing

In [139]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

In [140]:
# Connect to collections 
db = client.city_explorer
col_airbnb = db.city_airbnb

In [141]:
# Change arrays of data into Pandas dataframe 
array = list(col_airbnb.find())
array[0].keys()
array1 = array[0].copy()
airbnb_london_df = pd.DataFrame.from_dict(array1['london'])
airbnb_london_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Entire home/apt in London, United Kingdom. • T...",London,"[51.544, -0.057]",BRIGHT MODERN & CLEAN 1 BED with 24h CHECK IN,[https://a0.muscache.com/im/pictures/73707732/...,$10,5,52,https://www.airbnb.com/rooms/5803665
1,"Entire home/apt in Greater London, United King...",Greater London,"[51.52654, -0.07485]",SPECTACULAR CLEAN 2-BEDROOM SHOREDITCH COTTAGE,[https://a0.muscache.com/im/pictures/108d05cc-...,$10,5,149,https://www.airbnb.com/rooms/1970167
2,"Entire home/apt in London, United Kingdom. Ama...",London,"[51.513, -0.186]",Compact Double Studio Next to Hyde Park H204,[https://a0.muscache.com/im/pictures/bad0470f-...,$51,4,210,https://www.airbnb.com/rooms/16242756
3,"Private room in London, United Kingdom. We off...",London,"[51.54383, 0.02659]",Single bedroom near London Stratford,[https://a0.muscache.com/im/pictures/74281506/...,$23,4.5,397,https://www.airbnb.com/rooms/4748665
4,"Private room in London, United Kingdom. Small ...",London,"[51.49066, -0.11658]",BIG BEN VINTAGE ROOM Nr2!,[https://a0.muscache.com/im/pictures/31396872/...,$64,4.5,433,https://www.airbnb.com/rooms/1753791

### 1-10-2. Transforming/Cleaning

In [142]:
# Check the number of data imported to match with data in MongoDB
len(airbnb_london_df)

293

In [143]:
# Check and clean data by dropping duplicates
airbnb_london_df.drop_duplicates('listing_url', inplace=True)
len(airbnb_london_df)

293

In [145]:
# Create a filtered dataframe with specific columns 
airbnb_london_df1 = airbnb_london_df[['listing_price', 'listing_rating']].copy()
airbnb_london_df1.head()

  listing_price listing_rating
0           $10              5
1           $10              5
2           $51              4
3           $23            4.5
4           $64            4.5

In [146]:
# Clean data by removing units 
airbnb_london_df1['listing_price'] = airbnb_london_df1['listing_price'].str.replace('$', '')
airbnb_london_df1.head()

  listing_price listing_rating
0            10              5
1            10              5
2            51              4
3            23            4.5
4            64            4.5

In [147]:
# Check the information about the dataframe 
airbnb_london_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 293 entries, 0 to 292
Data columns (total 2 columns):
listing_price     293 non-null object
listing_rating    293 non-null object
dtypes: object(2)
memory usage: 6.9+ KB

In [148]:
# Check the summary statistics of dataframe
airbnb_london_df1.describe() # Receiving a description of the objects rather than numerics summary

       listing_price listing_rating
count            293            293
unique            82              4
top               51            4.5
freq              19            167

In [149]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    airbnb_london_df1[col] = pd.to_numeric(airbnb_london_df1[col])

In [150]:
# Recheck the information about the dataframe
airbnb_london_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 293 entries, 0 to 292
Data columns (total 2 columns):
listing_price     293 non-null int64
listing_rating    293 non-null object
dtypes: int64(1), object(1)
memory usage: 6.9+ KB

In [151]:
# Recheck the summary statistics of dataframe
airbnb_london_df1.describe() # Receiving a description of the numerics

       listing_price
count     293.000000
mean       55.668942
std        30.536801
min        10.000000
25%        32.000000
50%        50.000000
75%        71.000000
max       205.000000

In [152]:
# Find the average of 'listing_price' group by 'listing_rating'
airbnb_london_df2 = airbnb_london_df1.groupby(['listing_rating']).mean()
airbnb_london_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
airbnb_london_df2.reset_index(level=0, inplace=True)
airbnb_london_df2.head()

  listing_rating  avg_price
0            3.5  59.142857
1              4  56.194444
2            4.5  56.658683
3              5  53.156627

In [153]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
airbnb_london_df3 = airbnb_london_df1.groupby(['listing_rating']).count()
airbnb_london_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
airbnb_london_df3.reset_index(level=0, inplace=True)
airbnb_london_df3.head()

  listing_rating  count_price
0            3.5            7
1              4           36
2            4.5          167
3              5           83

In [316]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
airbnb_london_df4 = airbnb_london_df3.merge(airbnb_london_df2, left_on="listing_rating", right_on="listing_rating")
airbnb_london_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
airbnb_london_df4.insert(0, 'city', 'London', True)
airbnb_london_df4.insert(1, 'type', 'Airbnb', True)
airbnb_london_df4

     city    type rating  count_price  avg_price
0  London  Airbnb    3.5            7  59.142857
1  London  Airbnb      4           36  56.194444
2  London  Airbnb    4.5          167  56.658683
3  London  Airbnb      5           83  53.156627

## 2. TripAdvisor Data

## 2-1. Seoul

### 2-1-1. Extracting/Importing

In [304]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [305]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_seoul_df = pd.DataFrame.from_dict(array1['seoul'])
trip_seoul_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,A Romanic Escape in the heart of Seoul. Under ...,"67 Toegye-ro Jung-gu, Seoul 04529 South Korea","[37.559654, 126.979645]",L'Escape Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",168,4.0,9,https://www.tripadvisor.com/Hotel_Review-g2941...
1,GLAD MAPO is located in the business of Seoul....,"92, Mapo-daero, Mapo-gu L Floor, Seoul 04168 S...","[37.543037, 126.951462]",GLAD Mapo,"[""https://media-cdn.tripadvisor.com/media/phot...",102,5.0,415,https://www.tripadvisor.com/Hotel_Review-g2941...
2,"HOTEL SKYPARK3,where N Seoul Tower and Namsan ...","139, Toegye-ro, Jung-gu, Seoul 04537 South Korea","[37.561356, 126.987236]",Hotel Skypark Myeongdong III,"[""https://media-cdn.tripadvisor.com/media/phot...",67,4.0,640,https://www.tripadvisor.com/Hotel_Review-g2941...
3,"We, HotelPJ, have always tried our best to pro...","71, Mareunnae-ro, Jung-gu, Seoul 04548 South K...","[37.564758, 126.995689]",Hotel PJ Myeongdong,"[""https://media-cdn.tripadvisor.com/media/phot...",81,4.5,"1,899",https://www.tripadvisor.com/Hotel_Review-g2941...
4,Hotel SKYPARK Kingstown Dongdaemin is a luxury...,"20, Jangchungdan-ro 13-gil, Jung-gu, Seoul 045...","[37.568939, 127.007713]",Hotel Skypark Kingstown Dongdaemun,"[""https://media-cdn.tripadvisor.com/media/phot...",92,4.5,967,https://www.tripadvisor.com/Hotel_Review-g2941...

### 2-1-2. Transforming/Cleaning

In [306]:
# Check the number of data imported to match with data in MongoDB
len(trip_seoul_df)

451

In [307]:
# Check and clean data by dropping duplicates
trip_seoul_df.drop_duplicates('listing_url', inplace=True)
len(trip_seoul_df)

434

In [308]:
# Create a filtered dataframe with specific columns 
trip_seoul_df1 = trip_seoul_df[['listing_price', 'listing_rating']].copy()
trip_seoul_df1.head()

  listing_price listing_rating
0           168            4.0
1           102            5.0
2            67            4.0
3            81            4.5
4            92            4.5

In [309]:
# Check the information about the dataframe 
trip_seoul_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 434 entries, 0 to 450
Data columns (total 2 columns):
listing_price     434 non-null object
listing_rating    434 non-null object
dtypes: object(2)
memory usage: 10.2+ KB

In [310]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_seoul_df1[col] = pd.to_numeric(trip_seoul_df1[col])

In [311]:
# Recheck the information about the dataframe
trip_seoul_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 434 entries, 0 to 450
Data columns (total 2 columns):
listing_price     434 non-null int64
listing_rating    434 non-null object
dtypes: int64(1), object(1)
memory usage: 10.2+ KB

In [312]:
# Check the summary statistics of dataframe
trip_seoul_df1.describe() # Receiving a description of the numerics

       listing_price
count     434.000000
mean       73.207373
std        51.349532
min        16.000000
25%        44.000000
50%        58.000000
75%        83.000000
max       545.000000

In [313]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_seoul_df2 = trip_seoul_df1.groupby(['listing_rating']).mean()
trip_seoul_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_seoul_df2.reset_index(level=0, inplace=True)
trip_seoul_df2.head()

  listing_rating  avg_price
0            3.5  54.900000
1            4.0  63.377358
2            4.5  87.942408
3            5.0  60.203704

In [314]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_seoul_df3 = trip_seoul_df1.groupby(['listing_rating']).count()
trip_seoul_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_seoul_df3.reset_index(level=0, inplace=True)
trip_seoul_df3.head()

  listing_rating  count_price
0            3.5           30
1            4.0          159
2            4.5          191
3            5.0           54

In [315]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_seoul_df4 = trip_seoul_df3.merge(trip_seoul_df2, left_on="listing_rating", right_on="listing_rating")
trip_seoul_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_seoul_df4.insert(0, 'city', 'Seoul', True)
trip_seoul_df4.insert(1, 'type', 'Hotel', True)
trip_seoul_df4

    city   type rating  count_price  avg_price
0  Seoul  Hotel    3.5           30  54.900000
1  Seoul  Hotel    4.0          159  63.377358
2  Seoul  Hotel    4.5          191  87.942408
3  Seoul  Hotel    5.0           54  60.203704

## 2-2. Tokyo

### 2-2-1. Extracting/Importing

In [156]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [157]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_tokyo_df = pd.DataFrame.from_dict(array1['tokyo'])
trip_tokyo_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"The hotel opened on October 4, 2018. The Asaku...","2-10-2 Kaminarimon, Taito 111-0034 Tokyo Prefe...","[35.709633, 139.795441]",Hotel Gracery Asakusa,"[""https://media-cdn.tripadvisor.com/media/phot...",98,4.5,45,https://www.tripadvisor.com/Hotel_Review-g1066...
1,Elegant atmosphere in a classic reminiscent of...,"6-3-3 Toyo, Koto 135-0016 Tokyo Prefecture","[35.674648, 139.814697]",Hotel East 21 Tokyo,"[""https://media-cdn.tripadvisor.com/media/phot...",68,4.0,900,https://www.tripadvisor.com/Hotel_Review-g1066...
2,Traces of the history and culture of the Edo (...,"6-6-7, Ueno, Taito 110-0005 Tokyo Prefecture","[35.708736, 139.775986]",Hotel Sardonyx Ueno,"[""https://media-cdn.tripadvisor.com/media/phot...",93,4.0,402,https://www.tripadvisor.com/Hotel_Review-g1413...
3,To an oasis with skyscraper views. 3 minutes` ...,"2-2-6 Higashigotanda, Shinagawa 141-0022 Tokyo...","[35.625210, 139.725281]",Mitsui Garden Hotel Gotanda,"[""https://media-cdn.tripadvisor.com/media/phot...",90,4.5,110,https://www.tripadvisor.com/Hotel_Review-g1066...
4,"Welcome to Hotel Niwa Tokyo, your Chiyoda “hom...","1-1-16 Kanda Misakicho, Chiyoda 101-0061 Tokyo...","[35.700623, 139.756683]",Hotel Niwa Tokyo,"[""https://media-cdn.tripadvisor.com/media/phot...",91,4.5,"2,261",https://www.tripadvisor.com/Hotel_Review-g1066...

### 2-2-2. Transforming/Cleaning

In [158]:
# Check the number of data imported to match with data in MongoDB
len(trip_tokyo_df)

476

In [160]:
# Check and clean data by dropping duplicates
trip_tokyo_df.drop_duplicates('listing_url', inplace=True)
len(trip_tokyo_df)

450

In [161]:
# Create a filtered dataframe with specific columns 
trip_tokyo_df1 = trip_tokyo_df[['listing_price', 'listing_rating']].copy()
trip_tokyo_df1.head()

  listing_price listing_rating
0            98            4.5
1            68            4.0
2            93            4.0
3            90            4.5
4            91            4.5

In [162]:
# Check the information about the dataframe 
trip_tokyo_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 450 entries, 0 to 475
Data columns (total 2 columns):
listing_price     450 non-null object
listing_rating    450 non-null object
dtypes: object(2)
memory usage: 10.5+ KB

In [163]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_tokyo_df1[col] = pd.to_numeric(trip_tokyo_df1[col])

In [164]:
# Recheck the information about the dataframe
trip_tokyo_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 450 entries, 0 to 475
Data columns (total 2 columns):
listing_price     450 non-null int64
listing_rating    450 non-null object
dtypes: int64(1), object(1)
memory usage: 10.5+ KB

In [165]:
# Check the summary statistics of dataframe
trip_tokyo_df1.describe() # Receiving a description of the numerics

       listing_price
count     450.000000
mean      124.911111
std       125.889587
min        29.000000
25%        63.000000
50%        86.000000
75%       131.000000
max       910.000000

In [166]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_tokyo_df2 = trip_tokyo_df1.groupby(['listing_rating']).mean()
trip_tokyo_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_tokyo_df2.reset_index(level=0, inplace=True)
trip_tokyo_df2.head()

  listing_rating   avg_price
0            3.5   73.928571
1            4.0   98.967871
2            4.5  180.337838
3            5.0  161.090909

In [167]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_tokyo_df3 = trip_tokyo_df1.groupby(['listing_rating']).count()
trip_tokyo_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_tokyo_df3.reset_index(level=0, inplace=True)
trip_tokyo_df3.head()

  listing_rating  count_price
0            3.5           42
1            4.0          249
2            4.5          148
3            5.0           11

In [301]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_tokyo_df4 = trip_tokyo_df3.merge(trip_tokyo_df2, left_on="listing_rating", right_on="listing_rating")
trip_tokyo_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_tokyo_df4.insert(0, 'city', 'Tokyo', True)
trip_tokyo_df4.insert(1, 'type', 'Hotel', True)
trip_tokyo_df4

    city   type rating  count_price   avg_price
0  Tokyo  Hotel    3.5           42   73.928571
1  Tokyo  Hotel    4.0          249   98.967871
2  Tokyo  Hotel    4.5          148  180.337838
3  Tokyo  Hotel    5.0           11  161.090909

## 2-3. Singapore

### 2-3-1. Extracting/Importing

In [170]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [171]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_singapore_df = pd.DataFrame.from_dict(array1['singapore'])
trip_singapore_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"Welcome to Sofitel Singapore City Centre, a lu...",9 Wallich Street Sofitel Singapore City Centre...,"[1.276915, 103.844971]",Sofitel Singapore City Centre,"[""https://media-cdn.tripadvisor.com/media/phot...",255,4.5,378,https://www.tripadvisor.com/Hotel_Review-g2942...
1,YOTEL's new Singapore hotel located on ultra-p...,"366 Orchard Road Yotel Singapore Orchard Road,...","[1.306451, 103.831207]",YOTEL Singapore,"[""https://media-cdn.tripadvisor.com/media/phot...",123,4.5,"2,293",https://www.tripadvisor.com/Hotel_Review-g2942...
2,Style meets substance in the heart of Orchard ...,"442 Orchard Road, Singapore 238879 Singapore","[1.307493, 103.828697]",Orchard Hotel Singapore,"[""https://media-cdn.tripadvisor.com/media/phot...",151,4.0,"4,396",https://www.tripadvisor.com/Hotel_Review-g2942...
3,very good location and near to subway station ...,"200 Middle Road Hotel G Singapore, Singapore 1...","[1.300837, 103.851532]",Hotel G Singapore,"[""https://media-cdn.tripadvisor.com/media/phot...",93,4.0,"3,084",https://www.tripadvisor.com/Hotel_Review-g2942...
4,"For the adventurers, the innovators, the explo...","90 Robertson Quay, Singapore 238259 Singapore","[1.290606, 103.837067]",M Social Singapore,"[""https://media-cdn.tripadvisor.com/media/phot...",104,4.0,947,https://www.tripadvisor.com/Hotel_Review-g2942...

### 2-3-2. Transforming/Cleaning

In [172]:
# Check the number of data imported to match with data in MongoDB
len(trip_singapore_df)

438

In [173]:
# Check and clean data by dropping duplicates
trip_singapore_df.drop_duplicates('listing_url', inplace=True)
len(trip_singapore_df)

408

In [175]:
# Create a filtered dataframe with specific columns 
trip_singapore_df1 = trip_singapore_df[['listing_price', 'listing_rating']].copy()
trip_singapore_df1.head()

  listing_price listing_rating
0           255            4.5
1           123            4.5
2           151            4.0
3            93            4.0
4           104            4.0

In [176]:
# Check the information about the dataframe 
trip_singapore_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 408 entries, 0 to 437
Data columns (total 2 columns):
listing_price     408 non-null object
listing_rating    408 non-null object
dtypes: object(2)
memory usage: 9.6+ KB

In [177]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_singapore_df1[col] = pd.to_numeric(trip_singapore_df1[col])

In [178]:
# Recheck the information about the dataframe
trip_singapore_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 408 entries, 0 to 437
Data columns (total 2 columns):
listing_price     408 non-null int64
listing_rating    408 non-null object
dtypes: int64(1), object(1)
memory usage: 9.6+ KB

In [179]:
# Check the summary statistics of dataframe
trip_singapore_df1.describe() # Receiving a description of the numerics

       listing_price
count     408.000000
mean      105.014706
std        83.178236
min        16.000000
25%        59.750000
50%        81.000000
75%       120.000000
max       716.000000

In [180]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_singapore_df2 = trip_singapore_df1.groupby(['listing_rating']).mean()
trip_singapore_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_singapore_df2.reset_index(level=0, inplace=True)
trip_singapore_df2.head()

  listing_rating  avg_price
0            1.0  42.000000
1            2.0  65.000000
2            2.5  63.461538
3            3.0  71.516667
4            3.5  78.545455

In [181]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_singapore_df3 = trip_singapore_df1.groupby(['listing_rating']).count()
trip_singapore_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_singapore_df3.reset_index(level=0, inplace=True)
trip_singapore_df3.head()

  listing_rating  count_price
0            1.0            1
1            2.0            6
2            2.5           13
3            3.0           60
4            3.5          110

In [300]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_singapore_df4 = trip_singapore_df3.merge(trip_singapore_df2, left_on="listing_rating", right_on="listing_rating")
trip_singapore_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_singapore_df4.insert(0, 'city', 'Singapore', True)
trip_singapore_df4.insert(1, 'type', 'Hotel', True)
trip_singapore_df4

        city   type rating  count_price   avg_price
0  Singapore  Hotel    1.0            1   42.000000
1  Singapore  Hotel    2.0            6   65.000000
2  Singapore  Hotel    2.5           13   63.461538
3  Singapore  Hotel    3.0           60   71.516667
4  Singapore  Hotel    3.5          110   78.545455
5  Singapore  Hotel    4.0          122  103.016393
6  Singapore  Hotel    4.5           92  171.315217
7  Singapore  Hotel    5.0            4   82.250000

## 2-4. New York City

### 2-4-1. Extracting/Importing

In [184]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [185]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_nyc_df = pd.DataFrame.from_dict(array1['nyc'])
trip_nyc_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,"A trailblazer in the boutique hotel world, the...","60 Thompson St, New York City, NY 10012-4308","[40.723999, -74.003296]",SIXTY SoHo,"[""https://media-cdn.tripadvisor.com/media/phot...",275,4.5,"1,317",https://www.tripadvisor.com/Hotel_Review-g6076...
1,YOTEL is a first class hotel experience at an ...,"570 10th Avenue (West 42nd Street), New York C...","[40.759247, -73.995506]",YOTEL New York,"[""https://media-cdn.tripadvisor.com/media/phot...",129,4.5,"12,618",https://www.tripadvisor.com/Hotel_Review-g6076...
2,"Pod 51 is the most affordable hotel in NYC, wi...","230 East 51st Street, New York City, NY 10022-...","[40.755775, -73.969101]",Pod 51 Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",123,4.0,"5,469",https://www.tripadvisor.com/Hotel_Review-g6076...
3,"Dream Midtown evokes a new, vibrant energy in ...","210 W 55th St, New York City, NY 10019-5467","[40.764557, -73.982018]",Dream Midtown,"[""https://media-cdn.tripadvisor.com/media/phot...",175,4.5,884,https://www.tripadvisor.com/Hotel_Review-g6076...
4,The Evelyn Hotel blends timeless style and ava...,"7 E 27th St, New York City, NY 10016-8701","[40.744015, -73.987274]",The Evelyn,"[""https://media-cdn.tripadvisor.com/media/phot...",246,5.0,215,https://www.tripadvisor.com/Hotel_Review-g6076...

### 2-4-2. Transforming/Cleaning

In [186]:
# Check the number of data imported to match with data in MongoDB
len(trip_nyc_df)

476

In [187]:
# Check and clean data by dropping duplicates
trip_nyc_df.drop_duplicates('listing_url', inplace=True)
len(trip_nyc_df)

446

In [191]:
# Create a filtered dataframe with specific columns 
trip_nyc_df1 = trip_nyc_df[['listing_price', 'listing_rating']].copy()
trip_nyc_df1.head()

  listing_price listing_rating
0           275            4.5
1           129            4.5
2           123            4.0
3           175            4.5
4           246            5.0

In [192]:
# Clean data by removing units 
trip_nyc_df1['listing_price'] = trip_nyc_df1['listing_price'].str.replace(',', '')
trip_nyc_df1.head()

  listing_price listing_rating
0           275            4.5
1           129            4.5
2           123            4.0
3           175            4.5
4           246            5.0

In [193]:
# Check the information about the dataframe 
trip_nyc_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 446 entries, 0 to 475
Data columns (total 2 columns):
listing_price     446 non-null object
listing_rating    446 non-null object
dtypes: object(2)
memory usage: 10.5+ KB

In [194]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_nyc_df1[col] = pd.to_numeric(trip_nyc_df1[col])

In [196]:
# Recheck the information about the dataframe
trip_nyc_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 446 entries, 0 to 475
Data columns (total 2 columns):
listing_price     446 non-null int64
listing_rating    446 non-null object
dtypes: int64(1), object(1)
memory usage: 10.5+ KB

In [197]:
# Check the summary statistics of dataframe
trip_nyc_df1.describe() # Receiving a description of the numerics

       listing_price
count     446.000000
mean      225.343049
std       151.961057
min        66.000000
25%       143.000000
50%       179.000000
75%       249.000000
max      1149.000000

In [198]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_nyc_df2 = trip_nyc_df1.groupby(['listing_rating']).mean()
trip_nyc_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_nyc_df2.reset_index(level=0, inplace=True)
trip_nyc_df2.head()

  listing_rating   avg_price
0            1.5   72.000000
1            2.0  156.666667
2            2.5  136.000000
3            3.0  149.928571
4            3.5  162.400000

In [199]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_nyc_df3 = trip_nyc_df1.groupby(['listing_rating']).count()
trip_nyc_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_nyc_df3.reset_index(level=0, inplace=True)
trip_nyc_df3.head()

  listing_rating  count_price
0            1.5            3
1            2.0            3
2            2.5            5
3            3.0           14
4            3.5           55

In [299]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_nyc_df4 = trip_nyc_df3.merge(trip_nyc_df2, left_on="listing_rating", right_on="listing_rating")
trip_nyc_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_nyc_df4.insert(0, 'city', 'New York City', True)
trip_nyc_df4.insert(1, 'type', 'Hotel', True)
trip_nyc_df4

            city   type rating  count_price   avg_price
0  New York City  Hotel    1.5            3   72.000000
1  New York City  Hotel    2.0            3  156.666667
2  New York City  Hotel    2.5            5  136.000000
3  New York City  Hotel    3.0           14  149.928571
4  New York City  Hotel    3.5           55  162.400000
5  New York City  Hotel    4.0          154  177.389610
6  New York City  Hotel    4.5          199  282.618090
7  New York City  Hotel    5.0           13  349.769231

## 2-5. Istanbul

### 2-5-1. Extracting/Importing

In [203]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [204]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_istanbul_df = pd.DataFrame.from_dict(array1['istanbul'])
trip_istanbul_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,Family-friendly Istanbul hotel is a short tram...,Gencturk Caddesi Sirvanizade Sokak No: 5 Vezne...,"[41.012012, 28.954916]",Holiday Inn Istanbul Old City,"[""https://media-cdn.tripadvisor.com/media/phot...",69,4.5,372,https://www.tripadvisor.com/Hotel_Review-g2939...
1,"Sura Hagia Sophia Hotel, located in Sultanahme...",Divanyolu Cd. Alemdar Mah. Ticarethane Sk. No....,"[41.008724, 28.976274]",Sura Hagia Sophia Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",120,4.5,"2,267",https://www.tripadvisor.com/Hotel_Review-g2939...
2,The iconic Hilton Istanbul Bosphorus with its ...,"Cumhuriyet Cad. no 50, Istanbul 34367 Turkey","[41.044357, 28.989841]",Hilton Istanbul Bosphorus,"[""https://media-cdn.tripadvisor.com/media/phot...",122,4.5,"3,146",https://www.tripadvisor.com/Hotel_Review-g2939...
3,Boasting a perfect location between 2 continen...,"Cihannuma Mah Saray Cd No 5, Istanbul 34353 Tu...","[41.047970, 29.009069]",Conrad Istanbul Bosphorus,"[""https://media-cdn.tripadvisor.com/media/phot...",108,4.5,"3,234",https://www.tripadvisor.com/Hotel_Review-g2939...
4,Five-star ambiance at Istanbul's one of the be...,"Asker Ocagi Cad 1 Taksim, Istanbul 34435 Turkey","[41.039711, 28.988289]",InterContinental Istanbul,"[""https://media-cdn.tripadvisor.com/media/phot...",110,4.5,"2,096",https://www.tripadvisor.com/Hotel_Review-g2939...

### 2-5-2. Transforming/Cleaning

In [205]:
# Check the number of data imported to match with data in MongoDB
len(trip_istanbul_df)

480

In [206]:
# Check and clean data by dropping duplicates
trip_istanbul_df.drop_duplicates('listing_url', inplace=True)
len(trip_istanbul_df)

447

In [207]:
# Create a filtered dataframe with specific columns 
trip_istanbul_df1 = trip_istanbul_df[['listing_price', 'listing_rating']].copy()
trip_istanbul_df1.head()

  listing_price listing_rating
0            69            4.5
1           120            4.5
2           122            4.5
3           108            4.5
4           110            4.5

In [208]:
# Check the information about the dataframe 
trip_istanbul_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 447 entries, 0 to 479
Data columns (total 2 columns):
listing_price     447 non-null object
listing_rating    447 non-null object
dtypes: object(2)
memory usage: 10.5+ KB

In [209]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_istanbul_df1[col] = pd.to_numeric(trip_istanbul_df1[col])

In [210]:
# Recheck the information about the dataframe
trip_istanbul_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 447 entries, 0 to 479
Data columns (total 2 columns):
listing_price     447 non-null int64
listing_rating    447 non-null object
dtypes: int64(1), object(1)
memory usage: 10.5+ KB

In [211]:
# Check the summary statistics of dataframe
trip_istanbul_df1.describe() # Receiving a description of the numerics

       listing_price
count     447.000000
mean       87.319911
std        57.883741
min        21.000000
25%        57.000000
50%        77.000000
75%       100.000000
max       547.000000

In [212]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_istanbul_df2 = trip_istanbul_df1.groupby(['listing_rating']).mean()
trip_istanbul_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_istanbul_df2.reset_index(level=0, inplace=True)
trip_istanbul_df2.head()

  listing_rating   avg_price
0            3.5   49.000000
1            4.0   71.100000
2            4.5   84.378092
3            5.0  113.445783

In [213]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_istanbul_df3 = trip_istanbul_df1.groupby(['listing_rating']).count()
trip_istanbul_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_istanbul_df3.reset_index(level=0, inplace=True)
trip_istanbul_df3.head()

  listing_rating  count_price
0            3.5            1
1            4.0           80
2            4.5          283
3            5.0           83

In [298]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_istanbul_df4 = trip_istanbul_df3.merge(trip_istanbul_df2, left_on="listing_rating", right_on="listing_rating")
trip_istanbul_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_istanbul_df4.insert(0, 'city', 'Istanbul', True)
trip_istanbul_df4.insert(1, 'type', 'Hotel', True)
trip_istanbul_df4

       city   type rating  count_price   avg_price
0  Istanbul  Hotel    3.5            1   49.000000
1  Istanbul  Hotel    4.0           80   71.100000
2  Istanbul  Hotel    4.5          283   84.378092
3  Istanbul  Hotel    5.0           83  113.445783

## 2-6. Paris

### 2-6-1. Extracting/Importing

In [217]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [218]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_paris_df = pd.DataFrame.from_dict(array1['paris'])
trip_paris_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,The hotel L'Interlude is five minutes away fro...,"258 avenue Daumesnil, 75012 Paris France","[48.836365, 2.403700]",Hotel L'interlude,"[""https://media-cdn.tripadvisor.com/media/phot...",122,4.0,550,https://www.tripadvisor.com/Hotel_Review-g1871...
1,"Housed in a charming 19th century building, La...","8 rue Philippe de Champagne 13th Arr., 75013 P...","[48.832951, 2.355320]",Hotel La Manufacture,"[""https://media-cdn.tripadvisor.com/media/phot...",106,4.5,"2,075",https://www.tripadvisor.com/Hotel_Review-g1871...
2,Enjoy the tranquil waterside setting of the Ho...,"68 Quai De La Seine 19 Arr., 75019 Paris France","[48.888233, 2.378554]",Holiday Inn Express Paris-Canal de la Villette,"[""https://media-cdn.tripadvisor.com/media/phot...",86,4.0,"1,327",https://www.tripadvisor.com/Hotel_Review-g1871...
3,Fred Hotel is a warm and intimate 3-star bouti...,"11, avenue Villemain 14th Arr., 75014 Paris Fr...","[48.832199, 2.316405]",Fred Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",85,4.5,898,https://www.tripadvisor.com/Hotel_Review-g1871...
4,Hotel de L'Union is an excellent choice for tr...,"65 rue des Pyrenees, 75020 Paris France","[48.852489, 2.406018]",Hotel de L'Union,"[""https://media-cdn.tripadvisor.com/media/oyst...",65,4.0,195,https://www.tripadvisor.com/Hotel_Review-g1871...

### 2-6-2. Transforming/Cleaning

In [219]:
# Check the number of data imported to match with data in MongoDB
len(trip_paris_df)

480

In [221]:
# Check and clean data by dropping duplicates
trip_paris_df.drop_duplicates('listing_url', inplace=True)
len(trip_paris_df)

454

In [225]:
# Create a filtered dataframe with specific columns 
trip_paris_df1 = trip_paris_df[['listing_price', 'listing_rating']].copy()
trip_paris_df1.head()

  listing_price listing_rating
0           122            4.0
1           106            4.5
2            86            4.0
3            85            4.5
4            65            4.0

In [226]:
# Clean data by removing units 
trip_paris_df1['listing_price'] = trip_paris_df1['listing_price'].str.replace(',', '')
trip_paris_df1.head()

  listing_price listing_rating
0           122            4.0
1           106            4.5
2            86            4.0
3            85            4.5
4            65            4.0

In [227]:
# Check the information about the dataframe 
trip_paris_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 454 entries, 0 to 479
Data columns (total 2 columns):
listing_price     454 non-null object
listing_rating    454 non-null object
dtypes: object(2)
memory usage: 10.6+ KB

In [228]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_paris_df1[col] = pd.to_numeric(trip_paris_df1[col])

In [229]:
# Recheck the information about the dataframe
trip_paris_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 454 entries, 0 to 479
Data columns (total 2 columns):
listing_price     454 non-null int64
listing_rating    454 non-null object
dtypes: int64(1), object(1)
memory usage: 10.6+ KB

In [230]:
# Check the summary statistics of dataframe
trip_paris_df1.describe() # Receiving a description of the numerics

       listing_price
count     454.000000
mean      176.392070
std       127.092275
min        58.000000
25%       120.000000
50%       147.500000
75%       188.000000
max      1287.000000

In [231]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_paris_df2 = trip_paris_df1.groupby(['listing_rating']).mean()
trip_paris_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_paris_df2.reset_index(level=0, inplace=True)
trip_paris_df2.head()

  listing_rating   avg_price
0            3.5  155.000000
1            4.0  139.215909
2            4.5  182.186235
3            5.0  354.137931

In [232]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_paris_df3 = trip_paris_df1.groupby(['listing_rating']).count()
trip_paris_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_paris_df3.reset_index(level=0, inplace=True)
trip_paris_df3.head()

  listing_rating  count_price
0            3.5            2
1            4.0          176
2            4.5          247
3            5.0           29

In [297]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_paris_df4 = trip_paris_df3.merge(trip_paris_df2, left_on="listing_rating", right_on="listing_rating")
trip_paris_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_paris_df4.insert(0, 'city', 'Paris', True)
trip_paris_df4.insert(1, 'type', 'Hotel', True)
trip_paris_df4

    city   type rating  count_price   avg_price
0  Paris  Hotel    3.5            2  155.000000
1  Paris  Hotel    4.0          176  139.215909
2  Paris  Hotel    4.5          247  182.186235
3  Paris  Hotel    5.0           29  354.137931

## 2-7. Dubai

### 2-7-1. Extracting/Importing

In [235]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [236]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_dubai_df = pd.DataFrame.from_dict(array1['dubai'])
trip_dubai_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,Welcome to the neighbourhood. Perfectly groome...,"Al Seef, Dubai Creek, Dubai United Arab Emirates","[25.256210, 55.311981]",Zabeel House Al Seef,"[""https://media-cdn.tripadvisor.com/media/phot...",46,4.5,193,https://www.tripadvisor.com/Hotel_Review-g2954...
1,A spectacular destination to ignite the imagin...,"No. 1, Palm Jumeirah, Dubai 6438 United Arab E...","[25.104191, 55.148609]",FIVE Palm Jumeirah Dubai,"[""https://media-cdn.tripadvisor.com/media/phot...",123,4.5,"4,759",https://www.tripadvisor.com/Hotel_Review-g2954...
2,Five-star Roda Al Murooj Hotel is situated acr...,"Al Saada Street Opposite Dubai Mall, Dubai 117...","[25.202711, 55.277889]",Roda Al Murooj,"[""https://media-cdn.tripadvisor.com/media/phot...",78,4.5,"4,574",https://www.tripadvisor.com/Hotel_Review-g2954...
3,"Award-winning city resort hotel in Dubai, towe...","Riyadh Street, Sheikh Rashid Road Dubai Health...","[25.228146, 55.327927]",Grand Hyatt Dubai,"[""https://media-cdn.tripadvisor.com/media/phot...",76,4.5,"5,089",https://www.tripadvisor.com/Hotel_Review-g2954...
4,486 luxurious rooms and suites offering stunni...,"Wyndham Dubai Marina Al Seba St 394 to, Dubai ...","[25.069147, 55.128471]",Wyndham Dubai Marina,"[""https://media-cdn.tripadvisor.com/media/phot...",85,4.5,"2,200",https://www.tripadvisor.com/Hotel_Review-g2954...

### 2-7-2. Transforming/Cleaning

In [237]:
# Check the number of data imported to match with data in MongoDB
len(trip_dubai_df)

477

In [238]:
# Check and clean data by dropping duplicates
trip_dubai_df.drop_duplicates('listing_url', inplace=True)
len(trip_dubai_df)

447

In [239]:
# Create a filtered dataframe with specific columns 
trip_dubai_df1 = trip_dubai_df[['listing_price', 'listing_rating']].copy()
trip_dubai_df1.head()

  listing_price listing_rating
0            46            4.5
1           123            4.5
2            78            4.5
3            76            4.5
4            85            4.5

In [242]:
# Clean data by removing units 
trip_dubai_df1['listing_price'] = trip_dubai_df1['listing_price'].str.replace(',', '')
trip_dubai_df1.head()

  listing_price listing_rating
0            46            4.5
1           123            4.5
2            78            4.5
3            76            4.5
4            85            4.5

In [243]:
# Check the information about the dataframe 
trip_dubai_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 447 entries, 0 to 476
Data columns (total 2 columns):
listing_price     447 non-null object
listing_rating    447 non-null object
dtypes: object(2)
memory usage: 10.5+ KB

In [244]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_dubai_df1[col] = pd.to_numeric(trip_dubai_df1[col])

In [245]:
# Recheck the information about the dataframe
trip_dubai_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 447 entries, 0 to 476
Data columns (total 2 columns):
listing_price     447 non-null int64
listing_rating    447 non-null object
dtypes: int64(1), object(1)
memory usage: 10.5+ KB

In [246]:
# Check the summary statistics of dataframe
trip_dubai_df1.describe() # Receiving a description of the numerics

       listing_price
count     447.000000
mean       90.335570
std       206.266403
min        21.000000
25%        38.000000
50%        54.000000
75%        87.500000
max      3989.000000

In [247]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_dubai_df2 = trip_dubai_df1.groupby(['listing_rating']).mean()
trip_dubai_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_dubai_df2.reset_index(level=0, inplace=True)
trip_dubai_df2.head()

  listing_rating   avg_price
0            3.0   31.600000
1            3.5   50.484375
2            4.0   51.614815
3            4.5   98.603687
4            5.0  331.769231

In [248]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_dubai_df3 = trip_dubai_df1.groupby(['listing_rating']).count()
trip_dubai_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_dubai_df3.reset_index(level=0, inplace=True)
trip_dubai_df3.head()

  listing_rating  count_price
0            3.0            5
1            3.5           64
2            4.0          135
3            4.5          217
4            5.0           26

In [296]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_dubai_df4 = trip_dubai_df3.merge(trip_dubai_df2, left_on="listing_rating", right_on="listing_rating")
trip_dubai_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_dubai_df4.insert(0, 'city', 'Dubai', True)
trip_dubai_df4.insert(1, 'type', 'Hotel', True)
trip_dubai_df4

    city   type rating  count_price   avg_price
0  Dubai  Hotel    3.0            5   31.600000
1  Dubai  Hotel    3.5           64   50.484375
2  Dubai  Hotel    4.0          135   51.614815
3  Dubai  Hotel    4.5          217   98.603687
4  Dubai  Hotel    5.0           26  331.769231

## 2-8. Kuala Lumpur

### 2-8-1. Extracting/Importing

In [251]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [252]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_kl_df = pd.DataFrame.from_dict(array1['kl'])
trip_kl_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,The 5-star hotel managed by Pan Pacific Hotels...,"Jalan Sultan Ismail Bukit Bintang, Kuala Lumpu...","[3.144478, 101.712242]",PARKROYAL Kuala Lumpur,"[""https://media-cdn.tripadvisor.com/media/phot...",59,4.0,"4,078",https://www.tripadvisor.com/Hotel_Review-g2985...
1,The Kuala Lumpur Journal is a stylish boutique...,"No 30 Jalan Beremi Off Jalan Sultan Ismail, Ku...","[3.148181, 101.710373]",The Kuala Lumpur Journal,"[""https://media-cdn.tripadvisor.com/media/phot...",70,4.5,"1,148",https://www.tripadvisor.com/Hotel_Review-g2985...
2,The Majestic Hotel Kuala Lumpur was built in t...,"No 5, Jalan Sultan Hishamuddin, Kuala Lumpur 5...","[3.138832, 101.692223]",The Majestic Hotel Kuala Lumpur,"[""https://media-cdn.tripadvisor.com/media/phot...",72,4.5,"3,126",https://www.tripadvisor.com/Hotel_Review-g2985...
3,Only ultramodern Atrium Hotel connected to Put...,"Jalan Putra, Kuala Lumpur 50350 Malaysia","[3.165508, 101.692146]",Seri Pacific Hotel Kuala Lumpur,"[""https://media-cdn.tripadvisor.com/media/phot...",47,4.0,"2,066",https://www.tripadvisor.com/Hotel_Review-g2985...
4,Experience this vibrant city at its best at th...,"3 Jalan Stesen Sentral, Kuala Lumpur 50470 Mal...","[3.135578, 101.685616]",Hilton Kuala Lumpur,"[""https://media-cdn.tripadvisor.com/media/phot...",82,4.5,"5,175",https://www.tripadvisor.com/Hotel_Review-g2985...

### 2-8-2. Transforming/Cleaning

In [253]:
# Check the number of data imported to match with data in MongoDB
len(trip_kl_df)

392

In [254]:
# Check and clean data by dropping duplicates
trip_kl_df.drop_duplicates('listing_url', inplace=True)
len(trip_kl_df)

392

In [255]:
# Create a filtered dataframe with specific columns 
trip_kl_df1 = trip_kl_df[['listing_price', 'listing_rating']].copy()
trip_kl_df1.head()

  listing_price listing_rating
0            59            4.0
1            70            4.5
2            72            4.5
3            47            4.0
4            82            4.5

In [256]:
# Check the information about the dataframe 
trip_kl_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 391
Data columns (total 2 columns):
listing_price     392 non-null object
listing_rating    392 non-null object
dtypes: object(2)
memory usage: 9.2+ KB

In [257]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_kl_df1[col] = pd.to_numeric(trip_kl_df1[col])

In [258]:
# Recheck the information about the dataframe
trip_kl_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 391
Data columns (total 2 columns):
listing_price     392 non-null int64
listing_rating    392 non-null object
dtypes: int64(1), object(1)
memory usage: 9.2+ KB

In [259]:
# Check the summary statistics of dataframe
trip_kl_df1.describe() # Receiving a description of the numerics

       listing_price
count     392.000000
mean       38.780612
std        29.921856
min         6.000000
25%        19.000000
50%        28.000000
75%        49.000000
max       208.000000

In [260]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_kl_df2 = trip_kl_df1.groupby(['listing_rating']).mean()
trip_kl_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_kl_df2.reset_index(level=0, inplace=True)
trip_kl_df2.head()

  listing_rating  avg_price
0            3.0  23.774194
1            3.5  29.544776
2            4.0  37.962963
3            4.5  59.794872
4            5.0  51.214286

In [261]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_kl_df3 = trip_kl_df1.groupby(['listing_rating']).count()
trip_kl_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_kl_df3.reset_index(level=0, inplace=True)
trip_kl_df3.head()

  listing_rating  count_price
0            3.0           31
1            3.5          134
2            4.0          135
3            4.5           78
4            5.0           14

In [295]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_kl_df4 = trip_kl_df3.merge(trip_kl_df2, left_on="listing_rating", right_on="listing_rating")
trip_kl_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_kl_df4.insert(0, 'city', 'Kuala Lumpur', True)
trip_kl_df4.insert(1, 'type', 'Hotel', True)
trip_kl_df4

           city   type rating  count_price  avg_price
0  Kuala Lumpur  Hotel    3.0           31  23.774194
1  Kuala Lumpur  Hotel    3.5          134  29.544776
2  Kuala Lumpur  Hotel    4.0          135  37.962963
3  Kuala Lumpur  Hotel    4.5           78  59.794872
4  Kuala Lumpur  Hotel    5.0           14  51.214286

## 2-9. Bangkok

### 2-9-1. Extracting/Importing

In [264]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [265]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_bangkok_df = pd.DataFrame.from_dict(array1['bangkok'])
trip_bangkok_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,Great service. The room my family (consisting ...,"17 Soi Ratchasak, Bamrung Mueang Road Samranra...","[13.751390, 100.503258]",Chern Hostel,"[""https://media-cdn.tripadvisor.com/media/phot...",24,4.5,649,https://www.tripadvisor.com/Hotel_Review-g2939...
1,AKARA HOTEL BANGKOK is where east meets west a...,372 Sri Ayutthaya Road Thanon Phyathai Rajthev...,"[13.756110, 100.541313]",Akara Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",123,5.0,917,https://www.tripadvisor.com/Hotel_Review-g2939...
2,Chatrium Hotel Riverside Bangkok is our multip...,"28 Charoenkrung Soi 70 Wat Phraya Krai, Bang K...","[13.710620, 100.510170]",Chatrium Hotel Riverside Bangkok,"[""https://media-cdn.tripadvisor.com/media/phot...",101,4.5,"10,296",https://www.tripadvisor.com/Hotel_Review-g2939...
3,Park Plaza Bangkok Soi 18 is an excellent choi...,"9 Sukhumvit Soi 18, Sukhumvit Road Klongteoy, ...","[13.732895, 100.562798]",Park Plaza Bangkok Soi 18,"[""https://media-cdn.tripadvisor.com/media/phot...",67,4.5,"2,855",https://www.tripadvisor.com/Hotel_Review-g2939...
4,Eastin Grand Hotel Sathorn is one of the premi...,"33/1 South Sathorn Road Yannawa, Sathon, Bangk...","[13.719151, 100.521927]",Eastin Grand Hotel Sathorn,"[""https://media-cdn.tripadvisor.com/media/phot...",92,4.5,"8,291",https://www.tripadvisor.com/Hotel_Review-g2939...

### 2-9-2. Transforming/Cleaning

In [266]:
# Check the number of data imported to match with data in MongoDB
len(trip_bangkok_df)

465

In [267]:
# Check and clean data by dropping duplicates
trip_bangkok_df.drop_duplicates('listing_url', inplace=True)
len(trip_bangkok_df)

448

In [268]:
# Create a filtered dataframe with specific columns 
trip_bangkok_df1 = trip_bangkok_df[['listing_price', 'listing_rating']].copy()
trip_bangkok_df1.head()

  listing_price listing_rating
0            24            4.5
1           123            5.0
2           101            4.5
3            67            4.5
4            92            4.5

In [269]:
# Check the information about the dataframe 
trip_bangkok_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 448 entries, 0 to 464
Data columns (total 2 columns):
listing_price     448 non-null object
listing_rating    448 non-null object
dtypes: object(2)
memory usage: 10.5+ KB

In [270]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_bangkok_df1[col] = pd.to_numeric(trip_bangkok_df1[col])

In [271]:
# Recheck the information about the dataframe
trip_bangkok_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 448 entries, 0 to 464
Data columns (total 2 columns):
listing_price     448 non-null int64
listing_rating    448 non-null object
dtypes: int64(1), object(1)
memory usage: 10.5+ KB

In [272]:
# Check the summary statistics of dataframe
trip_bangkok_df1.describe() # Receiving a description of the numerics

       listing_price
count     448.000000
mean       69.093750
std        58.225475
min        11.000000
25%        37.000000
50%        56.000000
75%        85.000000
max       632.000000

In [273]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_bangkok_df2 = trip_bangkok_df1.groupby(['listing_rating']).mean()
trip_bangkok_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_bangkok_df2.reset_index(level=0, inplace=True)
trip_bangkok_df2.head()

  listing_rating  avg_price
0            3.5  51.000000
1            4.0  53.890511
2            4.5  76.573585
3            5.0  71.733333

In [274]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_bangkok_df3 = trip_bangkok_df1.groupby(['listing_rating']).count()
trip_bangkok_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_bangkok_df3.reset_index(level=0, inplace=True)
trip_bangkok_df3.head()

  listing_rating  count_price
0            3.5            1
1            4.0          137
2            4.5          265
3            5.0           45

In [294]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_bangkok_df4 = trip_bangkok_df3.merge(trip_bangkok_df2, left_on="listing_rating", right_on="listing_rating")
trip_bangkok_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_bangkok_df4.insert(0, 'city', 'Bangkok', True)
trip_bangkok_df4.insert(1, 'type', 'Hotel', True)
trip_bangkok_df4

      city   type rating  count_price  avg_price
0  Bangkok  Hotel    3.5            1  51.000000
1  Bangkok  Hotel    4.0          137  53.890511
2  Bangkok  Hotel    4.5          265  76.573585
3  Bangkok  Hotel    5.0           45  71.733333

## 2-10. London

### 2-10-1. Extracting/Importing

In [277]:
# Initialize PyMongo to work with MongoDB Atlas
connect = 'mongodb+srv://sunmini2:passwordmongo@city-explorer-ocvlm.mongodb.net/test?retryWrites=true'
client = MongoClient(connect)

# Connect to collections 
db = client.city_explorer
col_tripadvisor = db.city_tripadvisor

In [278]:
# Change arrays of data into Pandas dataframe 
array = list(col_tripadvisor.find())
array[0].keys()
array1 = array[0].copy()
trip_london_df = pd.DataFrame.from_dict(array1['london'])
trip_london_df.head()

,listing_about,listing_address,listing_lat_lon,listing_name,listing_photos,listing_price,listing_rating,listing_review_num,listing_url
0,Set beside some of London's best parks and hom...,"46 Clarges Street, London W1J 7ER England","[51.506413, -0.144397]",The Fox Club,"[""https://media-cdn.tripadvisor.com/media/phot...",190,4.5,185,https://www.tripadvisor.com/Hotel_Review-g1863...
1,Travelodge London City hotel is an excellent c...,"20 Middlesex Street, London E1 7EX England","[51.515064, -0.074725]",Travelodge London City hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",62,4.5,877,https://www.tripadvisor.com/Hotel_Review-g1863...
2,Kings Cross has become a must-visit destinatio...,"324 Gray's Inn Road, London WC1X 8BU England","[51.528889, -0.119166]","Point A Hotel, London Kings Cross St Pancras","[""https://media-cdn.tripadvisor.com/media/phot...",72,4.0,"6,102",https://www.tripadvisor.com/Hotel_Review-g1863...
3,"The St. Athans Hotel, Bloomsbury, is a simple,...","20 Tavistock Place Russell Square, London WC1H...","[51.525242, -0.126478]",St. Athans Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",93,4.0,744,https://www.tripadvisor.com/Hotel_Review-g1863...
4,Conveniently located across the road from King...,"27 Argyle Street, London WC1H 8EP England","[51.528980, -0.123406]",Jesmond Dene Hotel,"[""https://media-cdn.tripadvisor.com/media/phot...",72,4.5,"1,862",https://www.tripadvisor.com/Hotel_Review-g1863...

### 2-10-2. Transforming/Cleaning

In [279]:
# Check the number of data imported to match with data in MongoDB
len(trip_london_df)

480

In [280]:
# Check and clean data by dropping duplicates
trip_london_df.drop_duplicates('listing_url', inplace=True)
len(trip_london_df)

453

In [281]:
# Create a filtered dataframe with specific columns 
trip_london_df1 = trip_london_df[['listing_price', 'listing_rating']].copy()
trip_london_df1.head()

  listing_price listing_rating
0           190            4.5
1            62            4.5
2            72            4.0
3            93            4.0
4            72            4.5

In [284]:
# Clean data by removing units 
trip_london_df1['listing_price'] = trip_london_df1['listing_price'].str.replace(',', '')
trip_london_df1.head()

  listing_price listing_rating
0           190            4.5
1            62            4.5
2            72            4.0
3            93            4.0
4            72            4.5

In [285]:
# Check the information about the dataframe 
trip_london_df1.info() # Found that 'listing_price' column data type is string

<class 'pandas.core.frame.DataFrame'>
Int64Index: 453 entries, 0 to 479
Data columns (total 2 columns):
listing_price     453 non-null object
listing_rating    453 non-null object
dtypes: object(2)
memory usage: 10.6+ KB

In [286]:
# Convert data type of column 'listing_price' from string to numeric 
cols = ['listing_price']
for col in cols:
    trip_london_df1[col] = pd.to_numeric(trip_london_df1[col])

In [287]:
# Recheck the information about the dataframe
trip_london_df1.info() # Found that 'listing_price' column data type is changed to numeric

<class 'pandas.core.frame.DataFrame'>
Int64Index: 453 entries, 0 to 479
Data columns (total 2 columns):
listing_price     453 non-null int64
listing_rating    453 non-null object
dtypes: int64(1), object(1)
memory usage: 10.6+ KB

In [288]:
# Check the summary statistics of dataframe
trip_london_df1.describe() # Receiving a description of the numerics

       listing_price
count     453.000000
mean      181.891832
std       134.255368
min        31.000000
25%       102.000000
50%       140.000000
75%       209.000000
max      1127.000000

In [289]:
# Find the average of 'listing_price' group by 'listing_rating'
trip_london_df2 = trip_london_df1.groupby(['listing_rating']).mean()
trip_london_df2.rename(columns={'listing_price':'avg_price'}, inplace=True)
trip_london_df2.reset_index(level=0, inplace=True)
trip_london_df2.head()

  listing_rating   avg_price
0            3.5   86.000000
1            4.0  130.933333
2            4.5  182.070370
3            5.0  329.276596

In [290]:
# Find the number (count) of 'listing_price' group by 'listing_rating'
trip_london_df3 = trip_london_df1.groupby(['listing_rating']).count()
trip_london_df3.rename(columns={'listing_price':'count_price'}, inplace=True)
trip_london_df3.reset_index(level=0, inplace=True)
trip_london_df3.head()

  listing_rating  count_price
0            3.5            1
1            4.0          135
2            4.5          270
3            5.0           47

In [293]:
# Join 'avg_price' and 'count_price' in one dataframe and include city name
trip_london_df4 = trip_london_df3.merge(trip_london_df2, left_on="listing_rating", right_on="listing_rating")
trip_london_df4.rename(columns={'listing_rating':'rating'}, inplace=True)
trip_london_df4.insert(0, 'city', 'London', True)
trip_london_df4.insert(1, 'type', 'Hotel', True)
trip_london_df4

     city   type rating  count_price   avg_price
0  London  Hotel    3.5            1   86.000000
1  London  Hotel    4.0          135  130.933333
2  London  Hotel    4.5          270  182.070370
3  London  Hotel    5.0           47  329.276596

## 3. Comparing Airbnb and Hotel (TripAdvisor) Data

In [344]:
# Merge Airbnb (10 cities) dataframe
airbnb_cities_df = airbnb_seoul_df4.append(airbnb_tokyo_df4)
airbnb_cities_df1 = airbnb_cities_df.append(airbnb_singapore_df4)
airbnb_cities_df2 = airbnb_cities_df1.append(airbnb_nyc_df4)
airbnb_cities_df3 = airbnb_cities_df2.append(airbnb_istanbul_df4)
airbnb_cities_df4 = airbnb_cities_df3.append(airbnb_paris_df4)
airbnb_cities_df5 = airbnb_cities_df4.append(airbnb_dubai_df4)
airbnb_cities_df6 = airbnb_cities_df5.append(airbnb_kl_df4)
airbnb_cities_df7 = airbnb_cities_df6.append(airbnb_bangkok_df4)
airbnb_cities_df8 = airbnb_cities_df7.append(airbnb_london_df4)
airbnb_cities_df8.head()

    city    type rating  count_price   avg_price
0  Seoul  Airbnb      4            2   31.500000
1  Seoul  Airbnb    4.5          135   34.266667
2  Seoul  Airbnb      5          141   40.907801
0  Tokyo  Airbnb    4.5           54  121.037037
1  Tokyo  Airbnb      5          250  132.504000

In [349]:
# Export Airbnb dataframe into CSV
airbnb_cities_df8.to_csv('/Users/sunminlee/Desktop/CUBootcamp2019/GroupProject/project3_cityexplorer_SL/ComparisonViz/airbnb_df.csv')

In [345]:
# Merge TripAdvisor (10 cities) dataframe
trip_cities_df = trip_seoul_df4.append(trip_tokyo_df4)
trip_cities_df1 = trip_cities_df.append(trip_singapore_df4)
trip_cities_df2 = trip_cities_df1.append(trip_nyc_df4)
trip_cities_df3 = trip_cities_df2.append(trip_istanbul_df4)
trip_cities_df4 = trip_cities_df3.append(trip_paris_df4)
trip_cities_df5 = trip_cities_df4.append(trip_dubai_df4)
trip_cities_df6 = trip_cities_df5.append(trip_kl_df4)
trip_cities_df7 = trip_cities_df6.append(trip_bangkok_df4)
trip_cities_df8 = trip_cities_df7.append(trip_london_df4)
trip_cities_df8.head()

    city   type rating  count_price  avg_price
0  Seoul  Hotel    3.5           30  54.900000
1  Seoul  Hotel    4.0          159  63.377358
2  Seoul  Hotel    4.5          191  87.942408
3  Seoul  Hotel    5.0           54  60.203704
0  Tokyo  Hotel    3.5           42  73.928571

In [350]:
# Export TripAdvisor dataframe into CSV
trip_cities_df8.to_csv('/Users/sunminlee/Desktop/CUBootcamp2019/GroupProject/project3_cityexplorer_SL/ComparisonViz/tripadv_df.csv')